src/tests/artillery.yml
config:
  target: 'http://localhost:9999'
  phases:
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: "Warm up the application"
    - duration: 120
      arrivalRate: 50
      name: "Sustained max load"
scenarios:
  - name: "stress test"
    flow:
      - get:
          url: "/?id=8"